Autodesk.Revit.DB.GraphicsStyle.GraphicsStyleType
The graphics style type.

Autodesk.Revit.DB.GraphicsStyle.GraphicsStyleCategory
The graphics style category.

Autodesk.Revit.DB.GraphicsStyle
The graphics style instance in Autodesk Revit document.